Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.AddRedlinesToCurrentSavedViewpoint
Converts the measurement to redlines. Then adds the redlines to the current saved viewpoint.
If there is no current saved viewpoint, then one is created.
Throws System.NotSupportedException:
Cannot convert to Redlines
Throws System.NotSupportedException:
No active viewer
Throws System.InvalidOperationException:
Failed to add redlines to current saved viewpoint

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.Difference
Returns the difference
Throws System.NotSupportedException:
Difference not set

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.EndPoint
Returns the end point
Throws System.NotSupportedException:
EndPoint not set

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.FirstPoint
Returns the first point
Throws System.NotSupportedException:
FirstPoint not set

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.MeasurementType
Returns the measurement type
Throws System.NotSupportedException:
Measurement not set

Autodesk.Navisworks.Api.DocumentParts.DocumentCurrentMeasurement.MeasurementValue
Returns the measurement value
Throws System.NotSupportedException:
Measurement not set